HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCcu6_regdef.h
/** \\brief  Timer Control Register 4 */
typedef struct _Ifx_CCU6_TCTR4_Bits
{
    unsigned int T12RR:1;                   /**< \brief [0:0] Timer T12 Run Reset (w) */
    unsigned int T12RS:1;                   /**< \brief [1:1] Timer T12 Run Set (w) */
    unsigned int T12RES:1;                  /**< \brief [2:2] Timer T12 Reset (w) */
    unsigned int DTRES:1;                   /**< \brief [3:3] Dead-Time Counter Reset (w) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int T12CNT:1;                  /**< \brief [5:5] Timer T12 Count Event (w) */
    unsigned int T12STR:1;                  /**< \brief [6:6] Timer T12 Shadow Transfer Request (w) */
    unsigned int T12STD:1;                  /**< \brief [7:7] Timer T12 Shadow Transfer Disable (w) */
    unsigned int T13RR:1;                   /**< \brief [8:8] Timer T13 Run Reset (w) */
    unsigned int T13RS:1;                   /**< \brief [9:9] Timer T13 Run Set (w) */
    unsigned int T13RES:1;                  /**< \brief [10:10] Timer T13 Reset (w) */
    unsigned int reserved_11:2;             /**< \brief \internal Reserved */
    unsigned int T13CNT:1;                  /**< \brief [13:13] Timer T13 Count Event (w) */
    unsigned int T13STR:1;                  /**< \brief [14:14] Timer T13 Shadow Transfer Request (w) */
    unsigned int T13STD:1;                  /**< \brief [15:15] Timer T13 Shadow Transfer Disable (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_TCTR4_Bits;

/** \\brief  Trap Control Register */
typedef struct _Ifx_CCU6_TRPCTR_Bits
{
    unsigned int TRPM0:1;                   /**< \brief [0:0] Trap Mode Control Bits 1, 0 (rw) */
    unsigned int TRPM1:1;                   /**< \brief [1:1] Trap Mode Control Bits 1, 0 (rw) */
    unsigned int TRPM2:1;                   /**< \brief [2:2] Trap Mode Control Bit 2 (rw) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int TRPEN:6;                   /**< \brief [13:8] Trap Enable Control (rw) */
    unsigned int TRPEN13:1;                 /**< \brief [14:14] Trap Enable Control for Timer T13 (rw) */
    unsigned int TRPPEN:1;                  /**< \brief [15:15] Trap Pin Enable (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_TRPCTR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ccu6_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_ACCEN0_Bits B;
} Ifx_CCU6_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_ACCEN1_Bits B;
} Ifx_CCU6_ACCEN1;

/** \\brief  Capture/Compare Register for Channel CC60 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC60R_Bits B;
} Ifx_CCU6_CC60R;

/** \\brief  Capture/Compare Shadow Reg. for Channel CC60 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC60SR_Bits B;
} Ifx_CCU6_CC60SR;

/** \\brief  Capture/Compare Register for Channel CC61 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC61R_Bits B;
} Ifx_CCU6_CC61R;

/** \\brief  Capture/Compare Shadow Reg. for Channel CC61 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC61SR_Bits B;
} Ifx_CCU6_CC61SR;

/** \\brief  Capture/Compare Register for Channel CC62 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC62R_Bits B;
} Ifx_CCU6_CC62R;

/** \\brief  Capture/Compare Shadow Reg. for Channel CC62 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC62SR_Bits B;
} Ifx_CCU6_CC62SR;

/** \\brief  Compare Register for T13 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC63R_Bits B;
} Ifx_CCU6_CC63R;

/** \\brief  Compare Shadow Register for T13 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC63SR_Bits B;
} Ifx_CCU6_CC63SR;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CLC_Bits B;
} Ifx_CCU6_CLC;

/** \\brief  Compare State Modification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CMPMODIF_Bits B;
} Ifx_CCU6_CMPMODIF;

/** \\brief  Compare State Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CMPSTAT_Bits B;
} Ifx_CCU6_CMPSTAT;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_ID_Bits B;
} Ifx_CCU6_ID;

/** \\brief  Interrupt Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_IEN_Bits B;
} Ifx_CCU6_IEN;

/** \\brief  Input Monitoring Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_IMON_Bits B;
} Ifx_CCU6_IMON;

/** \\brief  Interrupt Node Pointer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_INP_Bits B;
} Ifx_CCU6_INP;

